In [3]:
import pandas as pd
import numpy as np

In [4]:
sozlukVerisi={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38]}
havaDurumuDataFrame=pd.DataFrame(sozlukVerisi)

In [5]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [6]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [7]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [8]:
havaDurumuDataFrame.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [9]:
yeniVeri={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame=pd.DataFrame(yeniVeri)

In [10]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [11]:
yeniDataFrame.dropna(axis=1,thresh=1) #thresh 2 dediğimiz için 2 ve üzeri nan olan sütunları göstermiyor.

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [12]:
yeniDataFrame.fillna(20) #nan olan yerlere 20 değerini koyuyor

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## groupby

In [13]:
maasSozlugu={"Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
            "Çalısan İsmi":["Emircan","Umut","Sezer","Ahmet","Serhat","Atakan"],
             "Maas":[100,200,300,400,500,600]}
maasDataFrame=pd.DataFrame(maasSozlugu)

In [14]:
maasDataFrame

   Departman Çalısan İsmi  Maas
0    Yazılım      Emircan   100
1    Yazılım         Umut   200
2  Pazarlama        Sezer   300
3  Pazarlama        Ahmet   400
4      Hukuk       Serhat   500
5      Hukuk       Atakan   600

In [15]:
grupObjesi=maasDataFrame.groupby("Departman")

In [16]:
grupObjesi.mean()

C:\Users\emirc\AppData\Local\Temp\ipykernel_10056\104408460.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grupObjesi.mean()

            Maas
Departman
Hukuk      550.0
Pazarlama  350.0
Yazılım    150.0

In [17]:
grupObjesi.min()

          Çalısan İsmi  Maas
Departman
Hukuk           Atakan   500
Pazarlama        Ahmet   300
Yazılım        Emircan   100

In [18]:
grupObjesi.describe() #İSTATİKSEL DEĞERLERİ DÖNDÜRÜR.

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
Pazarlama   2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
Yazılım     2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0

In [19]:
sozluk1 = {"İSİM":["Ahmet","Mehmet","Zeynep","Atıl"],
           "SPOR":["Koşu","Yüzme","Koşu","Basketbol"],
            "Kalori":[100,200,300,400]
}

In [20]:
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [21]:
dataFrame1

     İSİM       SPOR  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [22]:
sozluk2 = {"İSİM":["Osman","Levent","Atlas","Fatma"],
           "SPOR":["Koşu","Yüzme","Koşu","Basketbol"],
            "Kalori":[200,100,50,200]
}

In [23]:
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6,7])

In [24]:
sozluk3 = {"İSİM":["Ayse","Mahmut","Duygu","Nur"],
           "SPOR":["Koşu","Yüzme","Badminton","Tenis"],
            "Kalori":[300,400,500,250]
}

In [25]:
dataFrame3=pd.DataFrame(sozluk3,index=[8,9,10,11])

In [26]:
dataFrame1

     İSİM       SPOR  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [27]:
dataFrame2

     İSİM       SPOR  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     200

In [28]:
dataFrame3

      İSİM       SPOR  Kalori
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## concatenation

In [29]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0) #dataframeleri alt alta birleştiriyor.

      İSİM       SPOR  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     200
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

## merge

In [30]:
mergesozluk1 = {"İSİM":["Ahmet","Mehmet","Zeynep","Atıl"],
           "SPOR":["Koşu","Yüzme","Koşu","Basketbol"],
}

In [31]:
mergeDataFrame1=pd.DataFrame(mergesozluk1)

In [32]:
mergeDataFrame1

     İSİM       SPOR
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [33]:
mergesozluk2 = {"İSİM":["Ahmet","Mehmet","Zeynep","Atıl"],
           "Kalori":[100,200,300,400],
}

In [34]:
mergeDataFrame2=pd.DataFrame(mergesozluk2)

In [35]:
mergeDataFrame2

     İSİM  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     300
3    Atıl     400

In [36]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="İSİM") #ON İLE ORTAK NOKTAYI YAZIYORUZ ORTAK NOKTAYA GÖRE TABLOLARI BİRŞELTİRİYOR.

     İSİM       SPOR  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [37]:
maasSozluk={"İsim": ["Atıl","Zeynep","Mehmet","Ahmet"],
            "Departman":["Yazılım","Satış","Pazarlama","Yazılım"],
            "Maas":[200,300,400,500]
}

In [38]:
maasDataFrame=pd.DataFrame(maasSozluk)

In [40]:
maasDataFrame

     İsim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [41]:
maasDataFrame["Departman"]

0      Yazılım
1        Satış
2    Pazarlama
3      Yazılım
Name: Departman, dtype: object

In [42]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [43]:
maasDataFrame["Departman"].nunique()

3

In [44]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [52]:
def bruttenNete(maas):
    return maas*0.66

In [53]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [55]:
maasDataFrame.isnull()#tabloda nan değer var mı onu gösterir.

    İsim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [56]:
yeniBirVeri={"Karakter Sınıfı":["South Park","South Park","Simpson","Simpson"],
            "Karakter İsmi":["Cartman","Kenny","Homer","Bart"],
            "Karakter Yas":[9,10,50,20]}

In [57]:
karakterDF=pd.DataFrame(yeniBirVeri)

In [58]:
karakterDF

  Karakter Sınıfı Karakter İsmi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20

In [61]:
karakterDF.pivot_table(values="Karakter Yas",index=["Karakter Sınıfı","Karakter İsmi"])
#aggfunc=np.sum ile karakter ismi aynı olan satırları toplatabiliriz

                               Karakter Yas
Karakter Sınıfı Karakter İsmi
Simpson         Bart                     20
                Homer                    50
South Park      Cartman                   9
                Kenny                    10